{"meta":{"title":"VALINE","subtitle":"","description":"valineJのBLOG","author":"John Doe","url":"http://example.com","root":"/"},"pages":[{"title":"404","text":"","path":"404/index.html","date":"11-18","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"11-18","excerpt":""},{"title":"about","text":"","path":"about/index.html","date":"11-18","excerpt":""},{"title":"categories","text":"","path":"categories/index.html","date":"11-18","excerpt":""}],"posts":[{"title":"动态规划与viterbi","text":"##题外话：接触到这个算法是在随机信号课的大作业上，大佬都太强了，我也得多做一点才行。这个算法在通信中有较多的应用，值得一学，本身也很简单分析的时候用到了图论，有一说一这个东西在刚学的时候感觉是1t4，现在看来比看着公式干瞪眼好多了，容易理解。而这次也顺便加强了关于图论的理解，开始抓到了从图到代码的一点苗头 ##正文开始我们举一个简单的例子在一个44的棋盘上，棋子要从左上角（0，0）移动到左下角（3，3）缺个图 44棋盘 #(1)后效性的与无后效思考以下两个情况：1、 棋子可向上下左右方向移动2、 棋子可向上下左右方向移动，但不能移动到曾经经过的位置。在情况1中，棋子移动以后，上一步决策的不会对下一步产生影响（不考虑边界的情况下），即无后效性；情况2中，棋子下一步不能选择之前经过的位置，即过去对未来产生了影响，故为后效性马尔可夫不仅为我们提供了一个高效的数学工具，其中无后效性的数学思想也同为重要。 #（2）动态规划我们将（2）中的例子稍作变换：有一个MN的棋盘，棋子要从左上角（0，0）移动到右下角（M,N）。规定棋子只能向左或相下移动，求一共有多少条路径。我们将棋盘定义为一个MN的二维数组Q，数组中的值表示到达该点的路径之和，这一点我个人认为是最为关键。 另一个关键在于找到数组之间的关系。首先可以确定一些简单的初始值来使我们的分析更为直观。本题中，第一行与第一列(Q[0,]和Q[,0])显然为1。由于棋子只能向下或向右移动，故Q[I,J]&#x3D;Q[I-1,J]+Q[I,J-1]。到此我们的算法就可以很简单的实现了（两个for就可以啦）。 这个问题还可以进一步推广，如加入一些障碍物，求解最短路径，分析方法与此题类似。一般来说，能够采用动态规划方法求解的问题，必须满足最优化原理和无后效性原则：1、动态规划的最优化原理，即子问题的局部最优将导致整个问题的全局最优。在最短路径问题中，A到E的最优路径上的任一点到终点E的路径，也必然是该点到终点E的条最优路径，即整体优化可以分解为若干个局部优化。2、动态规划的无后效性原则，当前的状态是此前历史的一个完整的总结，此前的历史只能通过当前的状态去影响过程未来的演变。由此可见，对于不能划分阶段的问题或不符合最优化原理的，不能用动态规划的方法来求解。为什么动态规划比搜索要快？就是因为动态规划的最优性原理和无后效性。在动态规划推导出一个阶段的结果时，会将其保留，再次遇到这个结果直接调用。 #从图论到viterbi西八，这里缺了好多图这里编程的一个关键在于，我们分析过程中可以发现在连续三层求出最短路径后，都有唯一确定对应的值欸，从这个角度是不是又可以看作是两层了，再次重复即可，那么在编程时，关键就是抓住这个“看作两层”的思想来找到数学关系，ez （睡大觉咯起来把图片搞懂然后把阅读人数，评论区这些搞好，之后狠狠的ylg）","path":"2022/12/03/2、动态规划与viterbi/","date":"12-03","excerpt":"","tags":[]},{"title":"blog相关操作","text":"还是写中文舒服，不过英语也不能落下假期多写写英语，现在挺忙没空学英语了QAQ 记录一些和blog相关的操作，老是容易忘记，人老了是这样的0.到blog目录右键git bush here 1、更换主题把要的主题文件夹解压放到theme下，改成方便的文件名在_config.yml拉到最下面找到 theme 属性，修改成对应的文件名（language改为zh-CN好像就支持中文了）（有些项目和这个不一样XD当前主题https://github.com/fluid-dev/hexo-theme-fluid 2、通常冒号后面要有个空格不然会报错YAMLException: bad indentation of a mapping entry (1:21) 3、重新部署hexo cleanhexo ghexo d部署不上去多试几次就行（大概 4、新发布文章hexo new newpapername然后在source&#x2F;_post中打开markdown文件，就可以开始编辑了。当你写完的时候，再最后再次重新部署（有时间得学学markdown 5、删除文章现在source删掉对应文章#然后删掉deployed文件夹（似乎现在并不需要最后重新部署","path":"2022/12/03/1、关于blog的一些注意事项（防止忘记/","date":"12-03","excerpt":"","tags":[]},{"title":"My first blog(real","text":"Its my first time to write my blog. I would like to present some experience of the problems which I solved in the blog-building process. 1. The tutorial I followed is this one https://blog.csdn.net/szjccc/article/details/121830084 which use gitee-page. gitee is a little bit complex so I finally chose github-pages. There is another reference https://blog.csdn.net/yaorongke/article/details/119089190 2.The first problem you should focus is the version of nodejs. As usual the older version may have less bugs. But it may cause something you can`t install because it needs the higher version. 3.The github repository name you need to set like this username.github.io , set as public and you would better to add readme as init. I don not know the reason, but I failed in the first time when i try accessing https://valinej.github.io/. So saaaaaaaaaaaaad.XD. 4. When you open the &quot; __config.yml &quot;, you will find that the deployment section is missing something. These missing things need to be completed by yourself 5. WHAT HELL? DAME HOW TO UPDATE MY PREVIOUS BLOGS ????","path":"2022/11/19/0、My-first-blog /","date":"11-19","excerpt":"","tags":[]}],"categories":[],"tags":[]}